[{"name": "CSIG17-WEB前端开发工程师（腾讯CSIG子公司)（西安）", "duty": "1、负责性能测试工具平台前端（WEB领域）界面开发。\n2、参与架构、组件、模块化、规范化的制定和研发。\n3、持续优化系统、框架、组件等。\n注：此岗位位腾讯集团旗下子公司编制", "require": "1、熟悉HTML/CSS/ES，对前端框架Vue、React等有项目实践。\n2、熟悉WEB前端性能，了解前端安全相关知识。\n3、熟悉Python，熟悉基于Python的常用WEB架构，如Django。\n4、计算机基础知识扎实，熟悉Linux/Mac/Windows。\n5、熟悉HTTP和相关网络协议。\n6、有学习能力和团队意识，有优良沟通意识，抗压能力强。"}, {"name": "Game Client Engineer Intern 100096", "duty": "Implement and improve a variety of fast and efficient core software using Unreal Engine 5;\nMaintain and build code using C++ for all assigned work streams;\nHelp provide architectural oversight across the entire application;\nCollaborate to devise optimal engineering solutions to technical challenges.\r\nWork Location: Singapore-CapitalSpring", "require": "Coding skills in one of the following programming languages: C++, python, TypeScript;\nFamiliarity with game engines, graphics APIs, and GPU programming;\nA strong sense of responsibility and good communication skills."}, {"name": "Associate Quality Assurance Engineer LightspeedCampus 100243", "duty": "Define technical design & architecture for new Automation solutions and actively implement automation features & develop high-quality code;\nWork with R&D teams and keep improving games modules compatibility testing, client/server performance testing, etc., to provide our players with a better experience. Singapore-CapitalSpring", "require": "Bachelor or higher degree from an accredited college/university;\nFamiliarity with one of the scripting languages: shell, perl, python;\nExpertise in LINUX and TCP/IP, HTTP messaging protocol."}, {"name": "Associate Game Client Engineer LightspeedCampus 100244", "duty": "Implement and improve a variety of fast and efficient core software using Unreal Engine 5;\nMaintain and build code using C++ for all assigned work streams;\nHelp provide architectural oversight across the entire application;\nCollaborate to devise optimal engineering solutions to technical challenges. Singapore-CapitalSpring", "require": "Strong coding skills in one of the following programming languages: C++, python, TypeScript;\nFamiliarity with game engines, graphics APIs, and GPU programming;\nA strong sense of responsibility and good communication skills."}, {"name": "Senior Game Tester", "duty": "About Tencent Games\nTencent Games was launched in 2003 and is now the largest gaming company in the world, achieving game-related revenues of $29.3 billion in 2020. As a leading global organization for game development, publishing, and operations, we are dedicated to providing high-quality interactive entertainment experiences to players and currently offer more than 140 games including PUBG MOBILE, Call of Duty Mobile, and League of Legends to hundreds of millions of players across more than 200 countries and regions. Tencent Games offers talented individuals the opportunity to help shape and build something unique within the gaming industry as a whole.\n\nJob Description\nResponsible for ensure not only the quality of the game but also the quality of processes within the QA team;\nValidate any changes and ensure that there are no issues;\nCreate, monitor, and resolve bug reports as well as provide feedback to other QA in improving the quality of their reports;\nDefine and promote quality standards in creating QA deliverables (Test Plans, Test Cases, Test reports, etc.) for the team;\nEnsure build stability by performing necessary tests and providing relevant reports that is clearly communicated within the team;\nWork with team leads to plan, schedule and ensure QA involvement in all phases of production;\nCollaborate with offsite teams and ensure QA team hit the objectives of the project;\nCommunicate effectively, constructively, and efficiently any issues or topics to key Stakeholders, Directors, Production Teams in addition to the cell/QA group.\r\nWork Location: Malaysia-Kuala Lumpur", "require": "Experience in Android, iOS, console and PC games preferred;\nKnowledge on latest game editors/engines or equivalent is a big plus;\nExperience in Programming & automation is a big plus;\nExperience in developing testing tools and testing scripts, in any of the following: C/C++, java, python."}, {"name": "TEG03-SRE(Singapore)", "duty": "Responsible for the operation and maintenance of big data cluster (Hadoop Hbase Hive Yarn Spark, etc.);\nResponsible for cluster performance optimization, expansion and contraction;\nResponsible for cluster monitoring and alarm, fault handling, data backup, user problem handling, etc.;", "require": "\nMore than 2 years of experience in big data cluster operation and maintenance;\nProficient in any language in Python Shell Java, familiar with Linux development environment and corresponding configuration, management and optimization;\nFamiliar with TCP/IP, HTTP and other protocols, and have good knowledge of network, security, database, computer architecture;"}, {"name": "Senior Machine Learning Engineer, ML Optimization - Lightspeed", "duty": "- Participate in define the team's technical roadmap for ML model optimization\n- Research, investigate and prototype model optimization techniques such as model quantization, compression or pruning to name a few\n- Develop framework to seamlessly incorporate optimizations into existing model training pipelines as well as into online service\r\nWork Location: UK-London | UK-Liverpool | Singapore-CapitalSpring | New Zealand-Remote", "require": "- Bachelor's degree or above in computer science, engineering or a related field strongly preferred\n- Experience with TensorRT as well as ML frameworks like Pytorch, TensorFlow, MXNet, etc\n- Strong experience with Python and C++ programming languages with an emphasis on good software engineering practices\n- Passionate about technology and being on the cutting edge"}, {"name": "芯片后端工程师（深圳）", "duty": "负责建立芯片后端设计流程，完成网表到GDS文件的交付，包括 FloorPlan、电源分配、时序优化、布局布线等；\n配合前端设计工程师，完成low power 定义、SDC 编写、synthesis、LEC 等工作；\n", "require": ".5年以上的芯片后端设计工作经验，有大规模 SoC 芯片设计成功量产经历；\n熟悉后端设计流程和工具：PR、CTS、STA、PV（DRV/LVS）、LEC、SYNTHESIS；\n熟悉使用脚本：TCL/Perl/Python"}, {"name": "Senior Backend Engineer", "duty": "● Responsible for the design and coding of support services in the process of game development and operation\n● Responsible for global deployment and maintenance of services\n● Collaborate with data and AI engineers to build large-scale data processing systems\r\nWork Location: UK-London", "require": "● Bachelor's degree or above in computer science, engineering or a related field\n● 3+ years of professional experience with building scalable services\n● Excellent programming ability, experience in C++/Python/Go language is preferred\n● Experience in WEB, cloud native, big data development is preferred\n● Passionate about learning and applying new, relevant technologies"}, {"name": "NLP senior researcher", "duty": "1. Design and build NLP algorithms for semantic analysis, intent recognition, chatbot, machine translation, knowledge graph, named-entity recognition.\n2. Conduct research to advance the state of the art in NLP and create technical solutions at scale to real world challenges in various application scenarios.\n3. Design and build NLP algorithms for semantic analysis, intent recognition, chatbot, machine translation, knowledge graph, named-entity recognition. Singapore-CapitalSpring | Singapore-WeWork", "require": "- Master’s degree or PhD. in computer science, AI, applied math, automation, pattern recognition, bioinformatics, statistics or a related field.\n- Proficient in one or more programming languages (e.g. C/C++, Java, python); \n- Experience in large-scale dat"}, {"name": "Quality Assurance Intern 5420814002", "duty": "'- Responsible for quality control of the games. Propose, follow-up and implement test plans. Monitor projects' production quality and implement improvements.\n- Gather and analyse product testing requirements. Explore more testing methodology and dimensions. Improve quality, efficiency and depth of testing process.\r\nWork Location: Singapore-CapitalSpring", "require": "'- Bachelor's degree in engineering, computer science or a related field is required.\n- Strong knowledge of software development. Experience in C/C++/Java/Python/PHP/GO.\n- Familiarity with Internet Protocols such as TCP/IP, HTTP, etc.\n- Strong verbal and written communication skills."}, {"name": "Backend Software Engineer Intern 5430952002", "duty": "'- Design and implement account service modules.\n- Design and implement related management system and tool-chain software.\n- Maintain the online service system, and solve the problems effectively.\n- Build backend systems and take charge of documenting requirements and specifications.\r\nWork Location: Singapore-WeWork", "require": "'- Bachelor degree in Computer Science, Computer Engineering or equivalent combination of education and experience.\n- Have experience with one or more general purpose programming languages including but not limited to: C/C++, Python or Go.\n- Have interest in cloud computing or related systems(AWS/GCP/Azure).\n- Excellent communication and written skills."}, {"name": "41343-Global 基础设施高级研发工程师", "duty": "1. 负责腾讯游戏海外基础设施相关系统设计、开发和优化；\n2. 负责设计、开发多云环境基础设施调度平台，解决运营过程中质量和效率问题；\n3. 负责设计、开发多云环境下的网络质量测速分析和优化工具平台，支持线上业务7*24小时的问题发现和调优。\n", "require": "1. 5年以上相关研发工作经验，熟悉AWS/微软云/GCP/腾讯云等公有云API，本科及以上学历； \n2. 精通全栈开发，包括Javascript/Python/Golang等两种或以上开发语言，掌握Vue/Django/Gin等前后端开发框架\n3.  熟练使用 Linux 系统常用命令，掌握Shell/Python脚本编写； \n4. 有运维相关流程、工具建设的能力，具备识别共性/重复性问题并转化为开发需求，实现通用性的运维平台或服务的能力；\n5. 具备快速学习掌握新知识的能力，良好的交付意识和沟通技巧，有DevOps、网络、监控等相关领域的知识和经验者优先考虑；\n"}, {"name": "CSIG17-大数据系统测试工程师（CSIG子公司）（武汉/长沙/西安）", "duty": "负责大数据hadoop，spark，ES, hive，flink，clickhouse以及数据湖等相关产品的测试工作； \n分析产品相关需求、设计、架构等，设计测试方法和测试用例；\n挖掘并跟进实施性能测试、竞品对比测试、稳定性等专项测试，保障和提升产品质量； \n负责建设产品相关的自动化测试、Devops等工作；\n不断改进测试过程、方法和技术，提升产品质量。\n注：此岗位为腾讯集团旗下子公司编制岗位", "require": "本科以上学历，3年以上大数据相关的开发/测试经验或对大数据有浓厚兴趣者优先考虑； \n熟悉大数据相关组件，包括spark,hive,es,clickhouse等，有spark，hive等调优经验者优先； \n有大数据集群部署经验优先，有丰富大数据场景经验，问题快速定位跟踪者优先。 \n有数据湖相关开发测试经验者优先； \n熟悉linux系统，精通一种或多种脚本语言（如python，shell），熟悉CICD 有python，java等编写经验者优先； \n具备良好的团队合作精神，善于协调沟通，具备较强的问题定位和推动解决能力； \n具备较强的抗压能力，能面对大数据的机遇与挑战，在较大压力下保持工作激情"}, {"name": "25928-图计算高级工程师", "duty": "分析网络传输测试数据，为业务调度提供准确指导信息，提高网络传输优化效率；\n分析网络传输连通性，及时发现故障点以及最优路径，降低网络故障对网络用户的影响。", "require": "3年以上数据分析、数据处理经验，1年以上网络开发经验；\n熟悉C++/Java/Python/Go中至少两种开发语言；\n熟悉常用的图计算算法，以及算法优化方式；\n熟悉Hadoop，GraphX，Pregel等常用数据计算平台。"}, {"name": "Game Research & Development Intern 100340", "duty": "As an intern of Lightspeed Tech Center, you will participate in projects regarding one of the following areas:\nWorking with scientists to research and develop advanced techniques in the following topics:\n3D geometric learning,  \nRe-meshing and UV optimization,\nPhysically-based animation and simulation\nMachine learning for computer graphics\nMotion planning in virtual city\nCharacter locomotion and control\nRealistic image synthesis and real-time rendering techniques\nResearching and developing tools and pipelines to facilitate the use of technologies in the game development environment\n \r\nWork Location: US-Irvine | US-Bellevue-8th Street | US-Los Angeles | US-Palo Alto", "require": "Strong coding skills in one of following programming languages: C++, python, TensorFlow/Torch\nSolid knowledge in calculus, linear algebra, basic numerical analysis\nA strong sense of responsibility and good communication skills\n \nPlus:\nGraduate students in a master or Ph.D. level program\nPublications on computer graphics/vision, machine learning, and robotics\nFamiliarity with game engine, graphics APIs, and GPU programming"}, {"name": "18425-外汇数据运营研发工程师", "duty": "1、负责外汇交易相关的全链路数据分析工作，包括数据采集方案设计、业务指标分析、市场风险分析、交易量预测、交易策略评估及优化等； \n2、为产品功能和运营策略提供数据依据，利用盈亏归因，回测等方法评估策略效果，提出策略优化建议； \n3、针对产品和运营相关的业务问题，与产品、运营配合，能够进行量化分析、数据建模，开展专项分析与效果评估工作，辅助业务决策，提出可行性策略。", "require": "1、本科及以上学历，计算机科学、数据科学、统计学、应用数学等相关专业，有3年及以上数据分析相关经验； \n2、熟练掌握常用的数据分析方法（如归因分析、策略回测等）以及实验设计方法，对于交易策略分析、A/B测试与实验评估有实际工作经验尤佳； \n3、熟练使用Python/Hive SQL语言，熟练使用Python的数据分析工具包、经典机器学习算法包；具有HIVE/Hadoop/Spark/Flink等大规模分布式平台使用经验；\n4、敏锐的数据洞察力、严谨的逻辑思维能力和系统的分析总结能力，擅长从数据中分析出有价值的信息； \n5、有外汇交易或者其他金融业务分析经验者优先。"}, {"name": "NLP Researcher-Reinforcement Learning Algorithms", "duty": "1.Develop state-of-the-art reinforcement learning algorithms, and apply them to solve real-world tasks.\n2.Research and explore new reinforcement learning algorithms, and support complete solutions for future company applications.\r\nWork Location: US-Bellevue-8th Street", "require": "1.Solid expertise in  reinforcement learning algorithms with hands-on implementation experience and deep understanding;2.PhD degree in Computer Science, Machine Learning, and other AI-related fields.3.Experienced on programming languages such as Python, Java, C/C++, C#, etc.4.Experienced at the current deep learning platforms such as PyTorch.5.Published papers at the top AI conferences such as NeurIPS, ICML, ICLR etc."}, {"name": "Senior Site Reliability Engineer", "duty": "1. Responsible for overseas deployment and maintenance, troubleshooting, capacity planning and performance optimization of IEG big data center system components and applications;\n2. Responsible for maintaining big data suites of overseas cloud platforms, monitoring and resource management, and ensuring the stability of data platforms and services;\n3. Responsible for the construction of automatic operation and maintenance tools to improve the efficiency of deployment and maintenance;\n4. Responsible for optimizing the architecture of data-related services, designing and implementing public cloud solutions such as fault tolerance and remote disaster recovery to improve product quality;\r\nWork Location: US-Palo Alto", "require": "1. Experience in automated operation and maintenance tool development is preferred;\n2. Proficient in more than one language (shell/python/GO, etc.);\n3. Familiar with the processing and maintenance of kubernetes container cluster and various resource objects, application deployment and monitoring;\n4. Familiar with mainstream public cloud service technologies and related operations of cloud service product tools;\n5. Has a passion for learning and functions well in a team."}, {"name": "Senior Site Reliability Engineer", "duty": "1. Responsible for overseas deployment and maintenance, troubleshooting, capacity planning and performance optimization of IEG big data center system components and applications;\n2. Responsible for maintaining big data suites of overseas cloud platforms, monitoring and resource management, and ensuring the stability of data platforms and services;\n3. Responsible for the construction of automatic operation and maintenance tools to improve the efficiency of deployment and maintenance;\n4. Responsible for optimizing the architecture of data-related services, designing and implementing public cloud solutions such as fault tolerance and remote disaster recovery to improve product quality;\r\nWork Location: US-Palo Alto", "require": "1. Experience in automated operation and maintenance tool development is preferred;\n2. Proficient in more than one language (shell/python/GO, etc.);\n3. Familiar with the processing and maintenance of kubernetes container cluster and various resource objects, application deployment and monitoring;\n4. Familiar with mainstream public cloud service technologies and related operations of cloud service product tools;\n5. Has a passion for learning and functions well in a team."}]